src/cf/Catalogs/СервисыВнешнегоПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СервисыВнешнегоПодписания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПриложенияПоИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПриложенияПоИмениДоступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияИзменений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСервиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСервисовВнешнегоПодписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыСервисовВнешнегоПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСервисовВнешнегоПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КабинетСотрудника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СервисыВнешнегоПодписания/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет предопределенные элементы.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	Объект = КабинетСотрудника.ПолучитьОбъект();
	Объект.ТипСервиса = Перечисления.ТипыСервисовВнешнегоПодписания.КабинетСотрудника;
	Объект.Наименование = НСтр("ru = '1С:Кабинет сотрудника'");
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	
КонецПроцедуры

// Настройки сервиса.
// 
// Параметры:
//  Сервис - СправочникСсылка.СервисыВнешнегоПодписания
// 
// Возвращаемое значение:
//  см. СтруктураНастроек
//
Функция НастройкиСервиса(Сервис) Экспорт
	
	Настройки = СтруктураНастроек();
	ИменаРеквизитов = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(Настройки);
	ИменаРеквизитов = СтрЗаменить(ИменаРеквизитов, "Сервис,", "");
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сервис, ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(Настройки, Реквизиты);
	Настройки.Сервис = Сервис;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Структура настроек.
// 
// Возвращаемое значение:
//  Структура - Структура настроек:
// * Сервис                                     - СправочникСсылка.СервисыВнешнегоПодписания
// * АдресПриложения                            - Строка
// * АдресПриложенияПоИмени                     - Строка
// * АдресПриложенияПоИмениДоступен             - Булево
// * ВерсияПриложения                           - Строка
//
Функция СтруктураНастроек()
	
	Результат = Новый Структура;
	Результат.Вставить("Сервис",							ПустаяСсылка());
	Результат.Вставить("АдресПриложения",					"");
	Результат.Вставить("АдресПриложенияПоИмени",			"");
	Результат.Вставить("АдресПриложенияПоИмениДоступен",	Ложь);
	Результат.Вставить("ВерсияПриложения",					"");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
